InformationRegisters/ЛБ_НастройкиСозданияНакладныхНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкиСозданияНакладныхНаОтгрузку</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядокВыбораДня</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокВыбораРасшифровка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеньНеделиРасшифровка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОграничениеОценки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеВключениеЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДнейДоступнаОтгрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОбъектыЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалога</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбъектаЗалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиНачальная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДолгаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ЗалоговыеБилетыЗаблокированные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ЗалоговыеБилетыЗаблокированные</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаБлокировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыБлокировкиЗБ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СтатусыЗалогодателейСлужебные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СтатусыЗалогодателейСлужебные</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СлужебныеСтатусыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_РасчетыСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РасчетыСКлиентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonForms/ЛБ_ФормаСозданияНакладнойНаОтгрузку/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация; 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса()); 
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних.ЕстьОграничениеОценки КАК ЕстьОграничениеОценки,
		               |	ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних.СуммаОценки КАК СуммаОценки
		               |ИЗ
		               |	РегистрСведений.ЛБ_НастройкиСозданияНакладныхНаОтгрузку.СрезПоследних(&Дата, Организация = &Организация) КАК ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();  
		Если Выборка.Следующий() тогда
			ЕстьОграничениеОценки = Выборка.ЕстьОграничениеОценки;
			СуммаОценкиДляОтбора = Выборка.СуммаОценки;  
		КонецЕсли;	 
	Иначе
		Отказ = Истина;
	КонецЕсли;	
	Если Параметры.Свойство("Ломбард") Тогда
		Ломбард = Параметры.Ломбард; 
	Иначе
		Отказ = Истина;
	КонецЕсли;
	ИнформацияДляПользователя();
КонецПроцедуры	


&НаСервере
Процедура ИнформацияДляПользователя() 
	Если ТаблицаВыбора.Количество() = 0 тогда 
		Элементы.ДекорацияВключитьВНакладную.Заголовок = "Не выбраны залоговые билеты для включения в накладную"; 
	Иначе   
		Отбор = новый Структура;
		Отбор.Вставить("Вкл", Истина);
		Строки = ТаблицаВыбора.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 тогда 
		    Элементы.ДекорацияВключитьВНакладную.Заголовок = "Не выбраны залоговые билеты для включения в накладную";
		Иначе  
			Элементы.ДекорацияВключитьВНакладную.Заголовок = "Выбраны " + Строка(Строки.Количество()) + " залоговых билетов для включения в накладную";
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	
	 
&НаКлиенте
Процедура ВыбратьЗБ(Команда)
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Организация", Организация); 
	ПараметрыФормы.Вставить("Ломбард", Ломбард);   
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗБ", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборЗалоговыхБилетов", ПараметрыФормы ,,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаСервере
Функция ПроверитьЕстьЗалогиДляРеализации(ЗБ, СтатусыОЗ) 
	ЗапросЗБ = Новый Запрос;
	ЗапросЗБ.УстановитьПараметр("СписокЗБ", ЗБ); 
	ЗапросЗБ.УстановитьПараметр("СтатусыОбъектаЗалога", СтатусыОЗ);
	ЗапросЗБ.Текст = "ВЫБРАТЬ
	                 |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога
	                 |ИЗ
	                 |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(, ЗалоговыйБилет = &СписокЗБ) КАК ЛБ_ОбъектыЗалогаОстатки
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(, ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
	                 |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	                 |			И ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога
	                 |ГДЕ
	                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога В(&СтатусыОбъектаЗалога)";         
	ТаблицаЗапроса = ЗапросЗБ.Выполнить().Выгрузить();
	Если ТаблицаЗапроса.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;	
	Возврат Истина;
КонецФункции  

&НаСервере
Функция ПроверитьНетБлокировки(ЗБ)
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ЗБ", ЗБ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ЗалоговыеБилетыЗаблокированныеСрезПоследних.Статус КАК Статус,
	               |	ЛБ_ЗалоговыеБилетыЗаблокированныеСрезПоследних.ДатаБлокировки КАК ДатаБлокировки
	               |ИЗ
	               |	РегистрСведений.ЛБ_ЗалоговыеБилетыЗаблокированные.СрезПоследних(, ЗалоговыйБилет = &ЗБ) КАК ЛБ_ЗалоговыеБилетыЗаблокированныеСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыБлокировкиЗБ.Блокировка тогда
			Если Выборка.ДатаБлокировки >= НачалоДня(ТекущаяДатаСеанса()) Тогда
				Возврат Выборка.ДатаБлокировки;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Возврат неопределено;
КонецФункции

//-Мельников
&НаСервере
Функция ПроверитьКлиентаНаБанкротство(ЗБ, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Используется КАК Используется
		|ИЗ
		|	РегистрСведений.ЛБ_СтатусыЗалогодателейСлужебные.СрезПоследних(
		|			&Дата,
		|			Залогодатель = &Залогодатель
		|				И Статус.Несостоятельный = ИСТИНА) КАК ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних";
	
	Запрос.УстановитьПараметр("Залогодатель", ЗБ.Залогодатель);
	//Запрос.УстановитьПараметр("Статус", Справочники.ЛБ_СлужебныеСтатусыКлиентов.НайтиПоКоду("000000003"));
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Используется;
	Иначе
		Возврат Ложь;
	КонецЕсли;;
	
КонецФункции
//-Мельников

&НаСервере
Функция ПолучитьНовыйСтатусЗБ(ЗБ)  
	Если НЕ ЕстьОграничениеОценки  Тогда
		Возврат Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную;
	КонецЕсли;
	
	ЗапросЗБ = Новый Запрос;  
	ЗапросЗБ.УстановитьПараметр("ЗБ", ЗБ); 
	ЗапросЗБ.УстановитьПараметр("Ломбард", Ломбард);
	ЗапросЗБ.Текст = "ВЫБРАТЬ
	                 |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                 |	СУММА(ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток) КАК СуммаОценки
	                 |ИЗ
	                 |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	                 |			,
	                 |			ЗалоговыйБилет = &ЗБ
	                 |				И Ломбард = &Ломбард) КАК ЛБ_ОбъектыЗалогаОстатки
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет";         
	Выборка = ЗапросЗБ.Выполнить().Выбрать();    
	ПовышеннаяОценка = Ложь;
	Если Выборка.Следующий() Тогда
		Если Выборка.СуммаОценки > СуммаОценкиДляОтбора тогда  
			ПовышеннаяОценка = Истина; 		
		КонецЕсли;	
    КонецЕсли;
	
	Если ПовышеннаяОценка Тогда  
		Возврат Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг;
	Иначе 
		Возврат Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную;
	КонецЕсли;	   
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицу()
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("СписокЗБ", СписокЗБ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Залогодатель КАК Залогодатель,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
	               |	ЛБ_РасчетыСКлиентамиОстатки.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(, ЗалоговыйБилет В (&СписокЗБ)) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛБ_РасчетыСКлиентами.Остатки КАК ЛБ_РасчетыСКлиентамиОстатки
	               |		ПО ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет = ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	//ТаблицаВыбора.Очистить();     
	СтатусыОЗ = Новый СписокЗначений;
	СтатусыОЗ.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Возвращен);
	СтатусыОЗ.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Наследство);
	СтатусыОЗ.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Принят);
	СтатусыОЗ.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Продлен);
	СтатусыОЗ.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение);
	Для каждого Эл из СписокЗБ Цикл 
		Отбор = Новый Структура;
		Отбор.Вставить("ЗалоговыйБилет", Эл.Значение);
		
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Стр = Строки.Получить(0);
		НоваяСтр = ТаблицаВыбора.Добавить();
		НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет; 
		НоваяСтр.Залогодатель = Стр.Залогодатель;
		НоваяСтр.НомерЗалоговогоБилета = Стр.ЗалоговыйБилет.НомерЗалоговогоБилета;  
		НоваяСтр.СтатусЗБ = Стр.СтатусЗалоговогоБилета;   
		НоваяСтр.ДатаВыкупаЛьготная = Стр.ДатаВыкупаЛьготныйСрок;
		НоваяСтр.СуммаОстаток = Стр.СуммаОстаток;
		НоваяСтр.Вкл = Истина;   
		ДатаБлокировки =  ПроверитьНетБлокировки(НоваяСтр.ЗалоговыйБилет);
		Если НЕ ДатаБлокировки = неопределено Тогда
			НоваяСтр.Вкл = Ложь;
			НоваяСтр.Информация = "Залоговый билет заблокирован до " + Формат(ДатаБлокировки, "ДФ=dd.MM.yyyy"); 
		ИначеЕсли ПроверитьКлиентаНаБанкротство(НоваяСтр.ЗалоговыйБилет, ТекущаяДатаСеанса()) Тогда
			НоваяСтр.Вкл = Ложь;        
			НоваяСтр.Информация = "Заемщик является банкротом"; 
		ИначеЕсли ЛБ_ОбщегоНазначения.ПроверитьПоПеречням(ТекущаяДатаСеанса(), НоваяСтр.ЗалоговыйБилет) Тогда
			НоваяСтр.Вкл = Ложь;        
			НоваяСтр.Информация = "Заемщик найден в перечнях нежелательных лиц"; 		
		ИначеЕсли НоваяСтр.СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт Тогда
			НоваяСтр.Вкл = Ложь;        
			НоваяСтр.Информация = "Залоговый билет выкуплен"; 
		ИначеЕсли НоваяСтр.СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления Тогда
			НоваяСтр.Вкл = Ложь;        
			НоваяСтр.Информация = "Залоговый билет отменен"; 
		ИначеЕсли НоваяСтр.СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Реализован Тогда
			НоваяСтр.Вкл = Ложь;        
			НоваяСтр.Информация = "Залоговый билет реализован"; 	
		ИначеЕсли НоваяСтр.СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную Или
			  НоваяСтр.СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг ИЛИ
			  НоваяСтр.СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен Тогда
			НоваяСтр.Вкл = Ложь;        
			НоваяСтр.Информация = "Залоговый билет уже включен в накладную";
		ИначеЕсли Стр.ДатаВыкупаЛьготныйСрок > НачалоДня(ТекущаяДатаСеанса()) Тогда
			НоваяСтр.Вкл = Ложь; 
			НоваяСтр.Информация = "Дата окончания льготного периода " +  Формат(Стр.ДатаВыкупаЛьготныйСрок, "ДФ=dd.MM.yyyy");	
		ИначеЕсли НЕ ПроверитьЕстьЗалогиДляРеализации(НоваяСтр.ЗалоговыйБилет, СтатусыОЗ) Тогда
			НоваяСтр.Вкл = Ложь;
			НоваяСтр.Информация = "Нет объектов залога для включения в накладную";
		КонецЕсли;   
		Если НоваяСтр.Вкл Тогда
			НоваяСтр.СтатусЗБПосле = ПолучитьНовыйСтатусЗБ(НоваяСтр.ЗалоговыйБилет);	
		КонецЕсли;	
	Конеццикла;	
КонецПроцедуры	
	
&НаКлиенте
Процедура ПослеВыбораЗБ(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	СписокЗБ = Результат; 
	ЗаполнитьТаблицу();  
	ИнформацияДляПользователя();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНакладную(Команда)       
	СписокЗБВключить = Новый СписокЗначений;
	Для каждого стр Из ТаблицаВыбора Цикл    
		Если Стр.Вкл Тогда
			СписокЗБВключить.Добавить(Стр.ЗалоговыйБилет);
		КонецЕсли;	
	КонецЦикла;	
	Если СписокЗБВключить.Количество() = 0 Тогда
		Предупреждение("Не выбраны залоговые билеты для включение в накладную");    
	Иначе      
		СтруктураВозврата = Новый Структура; 
		СтруктураВозврата.Вставить("Ломбард", Ломбард);  
		СтруктураВозврата.Вставить("СписокЗБ", СписокЗБВключить);
		Закрыть(СтруктураВозврата);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОбработатьВкл(ЗБ, Вкл) 
	Отбор = Новый структура;
	Отбор.Вставить("ЗалоговыйБилет", ЗБ);
	Строки = ТаблицаВыбора.НайтиСтроки(Отбор); 		
	Для Каждого Стр Из Строки Цикл  
		Стр.Вкл = Вкл;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораВклПриИзменении(Элемент) 
	ТекСтрока = Элементы.ТаблицаВыбора.ТекущиеДанные;	
	ОбработатьВкл(ТекСтрока.ЗалоговыйБилет, ТекСтрока.Вкл);
	ИнформацияДляПользователя();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБ(Идентификатор) 
	Стр = ТаблицаВыбора.НайтиПоИдентификатору(Идентификатор);
	Возврат Стр.ЗалоговыйБилет;
КонецФункции	
	
&НаКлиенте
Процедура ИсторияЗалоговогоБилета(Команда)
	ТекСтрока = Элементы.ТаблицаВыбора.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда
		ЗБ = ПолучитьЗБ(ТекСтрока.ПолучитьИдентификатор());
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ТекСтрока.Залогодатель);
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗБ);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры
